DoS Testmessages/Metro-EncSign_allowedInjectionPlaces.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:met="http://metro1.kmzs.ba/" $$PAYLOADATTR$$>
   <soapenv:Header $$PAYLOADATTR$$><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" $$PAYLOADATTR$$><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-94F51A72B114DE341F14741096552139"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="met soapenv" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-94F51A72B114DE341F14741096552028"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="met" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>YLBXhJLXwvrFLhmhUOwuRg0IIv4=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>fILgBHQyDF38WHDHYteW5CYKEBlb1vyyrKrmNBPEYk6X82qaiZw5GmC4M2r+2CaHqCfyrnR+iO4qOy3Uddk8pfqNJKShxT5GsnfOFDlBDvDQSD5UXTvNKFEzIfH8DMPbJg6wMQ0E0JQH+BE0z+ILskQLhn7SrLMZxL/5UWx0bnNtHDU4nzgfHldN3MUfO/3fYCVrnpeofUa4Rucb/YoXsASmvN7T+Eao6kHP0wk6CqVU0w5cI0kY9EFLwlzyXp7xiPzRifC31PuOTGZD0h26VUSko8xrrsD81snQc4e6RxJi+xHoi5dornCOrJIsJ8iZjelzoQ46O7JDlgrkfNsG1A==</ds:SignatureValue><ds:KeyInfo Id="KI-94F51A72B114DE341F14741096551986" $$PAYLOADATTR$$><wsse:SecurityTokenReference $$PAYLOADATTR$$ wsu:Id="STR-94F51A72B114DE341F14741096551987"><ds:X509Data $$PAYLOADATTR$$><ds:X509IssuerSerial><ds:X509IssuerName>CN=client</ds:X509IssuerName><ds:X509SerialNumber>1034513739</ds:X509SerialNumber></ds:X509IssuerSerial>$$PAYLOADELEMENT$$</ds:X509Data>$$PAYLOADELEMENT$$</wsse:SecurityTokenReference>$$PAYLOADELEMENT$$<ds:PGPData $$PAYLOADATTR$$>$$PAYLOADELEMENT$$</ds:PGPData><ds:RetrievalMethod><ds:Transforms><ds:Transform $$PAYLOADATTR$$>$$PAYLOADELEMENT$$</ds:Transform></ds:Transforms></ds:RetrievalMethod><ds:SPKIData $$PAYLOADATTR$$>$$PAYLOADELEMENT$$</ds:SPKIData><ds:X509Data $$PAYLOADATTR$$>$$PAYLOADELEMENT$$</ds:X509Data></ds:KeyInfo></ds:Signature><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EK-94F51A72B114DE341F14741096551653"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#" $$PAYLOADATTR$$><wsse:SecurityTokenReference $$PAYLOADATTR$$><ds:X509Data $$PAYLOADATTR$$><ds:X509IssuerSerial><ds:X509IssuerName>CN=server</ds:X509IssuerName><ds:X509SerialNumber>1993907142</ds:X509SerialNumber></ds:X509IssuerSerial>$$PAYLOADELEMENT$$</ds:X509Data>$$PAYLOADELEMENT$$</wsse:SecurityTokenReference>$$PAYLOADELEMENT$$<ds:PGPData $$PAYLOADATTR$$>$$PAYLOADELEMENT$$</ds:PGPData><ds:RetrievalMethod><ds:Transforms><ds:Transform $$PAYLOADATTR$$>$$PAYLOADELEMENT$$</ds:Transform></ds:Transforms></ds:RetrievalMethod><ds:SPKIData $$PAYLOADATTR$$>$$PAYLOADELEMENT$$</ds:SPKIData><ds:X509Data $$PAYLOADATTR$$>$$PAYLOADELEMENT$$</ds:X509Data></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>cJXdaAPTvjG1AvIIDlMuIj0s0FNjhAfeG+qgYefKPeTXGpiXYGBdxMdpQGaYTeYEKFGiegt3dNw5mdm14aSjSMgLayJlatZRF5LTd1kl4geWGBbHJn5ZMns10NqoH6O1OP8hozkL6gDdqR/JEHYIGncZdYN6mOku5akW2/h7h3tEWicditCJPaEi0pwxolLnvUh1wHlp5vKbnx2I5Q/OWBbQWfAbgkA3UjWmhw1gaCK6dItpWltcJvyZ6apt6aFAIBUdJ8UTNoBauPdOLA2PtJ9ZY6R5agVU9OSaVXZHR/xaDiyVV1xcx7n8kO6h9BqDXsV1/EZrJBR5nDvFI5cSQA==</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#ED-94F51A72B114DE341F14741096551674"/></xenc:ReferenceList></xenc:EncryptedKey></wsse:Security></soapenv:Header>
   <soapenv:Body wsu:Id="id-94F51A72B114DE341F14741096552028" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData Id="ED-94F51A72B114DE341F14741096551674" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"><wsse:Reference URI="#EK-94F51A72B114DE341F14741096551653"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>ClPULTiY5xLP+3FXK4twe20nWzygQMULKxnd4WBbQ+C/pIRmrOhPAoMV3IwHv48qbo2rAg26bw/5jRox1Kmj9g==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soapenv:Body>
$$PAYLOADELEMENT$$</soapenv:Envelope>